module.exports = {
  signin: {
    title: 'ลงชื่อเข้าใช้ระบบขอลูกค้า',
    user: 'ชื่อผู้ใช้',
    pass: 'รหัสผ่าน',
    forget: 'ลืมรหัสผ่าน?',
    remember: 'จำชื่อผู้ใช้ไว้',
    act_signin: 'เข้าสู่ระบบ',
    signin_success:'เข้าสู่ระบบสำเร็จ',
    err_invalid_user:'ไม่พบชื่อผู้ใช้ กรุณาตรวจสอบ',
    err_invalid_pass:'รหัสผ่านไม่ถูกต้อง กรุณาตรวจสอบ',
    err_account_disabled:'ชื่อผู้ใช้ถูกระงับการใช้งานชั่วคราว กรุณาติดต่อผู้ดูแล',
    err_unknown:'เกิดข้อผิดพลาด กรุณาลองใหม่อีกครั้ง'
  }
};
